//Импорт стандартного пакета:
//        Создайте новый проект и в нем класс. В этом классе используйте классы из стандартного пакета java.util, например, Scanner, чтобы прочитать ввод пользователя с клавиатуры.
//
//        Создание своего пакета:
//        Создайте новый пакет в вашем проекте и поместите в него несколько классов. После этого создайте новый класс в основном пакете и используйте классы из созданного вами пакета.
//
//        Использование сторонних пакетов:
//        Используйте сторонний пакет, например, org.apache.commons.math3 для выполнения некоторых математических операций, например, вычисления квадратного корня или логарифма.
//
//        Создание своего пакета и его экспорт:
//        Создайте новый пакет с несколькими классами. Затем экспортируйте этот пакет, чтобы он мог быть использован в других проектах.
//
//        Использование пакета из стандартной библиотеки:
//        Используйте пакет из стандартной библиотеки Java, например, java.awt, чтобы создать графический интерфейс (простое окно с кнопкой или текстовым полем).

public class Exercise8 {
    public static void main(String[] args) {

    }
}
