//Если выписать все натуральные числа меньше 10, кратные 3 или 5, то получим 3, 5, 6 и 9. Сумма этих чисел равна 23.
//
//Найдите сумму всех чисел меньше 1000, кратных 3 или 5.

public class Exercise1 {
    public static void main(String[] args) {
        String word = "word";
        System.out.print(new StringBuilder(word).reverse().toString());
    }
}

